
* Table of contents                               :toc_2:noexport:
- [[#introduction][Introduction]]
- [[#setup][Setup]]
  - [[#inputs][Inputs]]
  - [[#process][Process]]
  - [[#outputs][Outputs]]

* Introduction

This documents and demonstrates the historical IDL workflow

* Setup

** Inputs

+ These are the input files (using EGP as one example station).
+ All raw data files have entries in the [[./data/metadata/EGP_metadata.csv]].

#+BEGIN_SRC bash :results verbatim :exports results
find ./data | grep -v ./data/out
#+END_SRC

#+RESULTS:
#+begin_example
./data
./data/data_raw
./data/data_raw/EGP raw
./data/data_raw/EGP raw/EGP_2018_raw.txt
./data/data_raw/EGP raw/EGP_2016_raw.txt
./data/data_raw/EGP raw/EGP_2019_raw1.txt
./data/data_raw/EGP raw/EGP_2019_raw_transmitted.txt
./data/data_raw/EGP raw/EGP_2017_raw_2.txt
./data/data_raw/EGP raw/EGP_2017_raw_SlimTableMem.txt
./data/data_raw/EGP raw/EGP_2018_raw_2.txt
./data/data_raw/EGP raw/EGP_2019_raw.txt
./data/metadata
./data/metadata/EGP_metadata.csv
#+end_example


** Process

#+BEGIN_SRC bash :results verbatim :exports both
gdl                        ; can also use IDL
exec 2>&1                  ; capture stdout and stderr in Org babel
.com AWSdataprocessing_v3  ; compile
 AWSdataprocessing_v3      ; run
:                          ; stdout & stderr Org
#+END_SRC

#+RESULTS:
#+begin_example
% Compiled module: AWSDATAPROCESSING_V3.
File: EGP_2016_raw.txt
Date and time: 2016/ 5/ 1 14: 30
File: EGP_2017_raw_SlimTableMem.txt
Date and time: 2016/ 7/ 19 16: 0
File: EGP_2017_raw_2.txt
Date and time: 2017/ 5/ 12 17: 50
File: EGP_2018_raw.txt
Date and time: 2017/ 8/ 8 18: 50
File: EGP_2018_raw_2.txt
Date and time: 2018/ 5/ 30 20: 40
File: EGP_2019_raw.txt
Date and time: 2018/ 8/ 6 18: 40
File: EGP_2019_raw1.txt
Date and time: 2019/ 6/ 2 22: 0
File: EGP_2019_raw_transmitted.txt
Date and time: 2019/ 7/ 29 12: 0
% Compiled module: INTERPOL.
% Compiled module: FINDEX.
- Sun in view of upper sensor / workable albedos:       29884          22%
- Sun below horizon:       56353          41%
- Sun in view of lower sensor:        1173           0%
- Spikes removed using TOA criteria:        4991           3%
- Mean net SR change by corrections:      2.99920 W/m2
done writing instEGP
total_lines:       135600
% Warning: multi-page PostScript not supported yet (FIXME!)
% Warning: multi-page PostScript not supported yet (FIXME!)
% Warning: multi-page PostScript not supported yet (FIXME!)
% Warning: multi-page PostScript not supported yet (FIXME!)
% Warning: multi-page PostScript not supported yet (FIXME!)
% Warning: multi-page PostScript not supported yet (FIXME!)
% AWSDATAPROCESSING_V3: Parser syntax error: unexpected token: 

Done with this station. Run time (minutes) =        25.729672
-----------------------------------------------------------
#+end_example



** Outputs

The following files are generated:

#+BEGIN_SRC bash :results verbatim :exports results
find ./data/out
#+END_SRC

#+RESULTS:
: ./data/out
: ./data/out/EGP_day_v03.txt
: ./data/out/EGP_inst_v03.txt
: ./data/out/EGP_hour_v03.txt
: ./data/out/EGP_day_v03.ps
: ./data/out/EGP_month_v03.txt

As an example, the top few lines and first few columns of [[./data/out/EGP_day_v03.txt]] looks like this:

#+BEGIN_SRC bash :exports results
head -n10 ./data/out/EGP_day_v03.txt | cut -c2- | sed 's/[[:space:]][[:space:]]*/,/g' | cut -d, -f1-7
#+END_SRC

#+RESULTS:
| Year | MonthOfYear | DayOfMonth | DayOfYear | DayOfCentury | AirPressure(hPa) | AirTemperature(C) |
| 2016 |           5 |          1 |       122 |         5966 |           -999.0 |            -999.0 |
| 2016 |           5 |          2 |       123 |         5967 |           723.74 |            -27.47 |
| 2016 |           5 |          3 |       124 |         5968 |           726.56 |            -28.24 |
| 2016 |           5 |          4 |       125 |         5969 |           726.98 |            -28.79 |
| 2016 |           5 |          5 |       126 |         5970 |           726.96 |            -27.42 |
| 2016 |           5 |          6 |       127 |         5971 |            724.3 |            -27.75 |
| 2016 |           5 |          7 |       128 |         5972 |           723.02 |            -26.73 |
| 2016 |           5 |          8 |       129 |         5973 |           724.55 |            -25.91 |
| 2016 |           5 |          9 |       130 |         5974 |           724.61 |            -19.93 |
